app/controllers/users_controller.rb

  def new
  if @facebook_session.nil?
      @user = User.new
  else
     @user = User.new(":birthday(1i)" =>"1960", :first_name => facebook_session.user.first_name , :last_name => facebook_session.user.last_name , :fb_user_id => facebook_session.user.uid, :password => "", :email => "", :fb_img => facebook_session.user.pic)
---
SELECT * FROM `users` WHERE (`users`.`fb_user_id` = 754801914) LIMIT 1

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    @user.gender = params[:gender]


    if !@facebook_session.nil?
	    @user.fb_user_id = facebook_session.user.uid
	    @user.fb_img = facebook_session.user.pic
	    @user.invitetoken = MD5.md5(ActiveSupport::SecureRandom.hex(16)).hexdigest
    end

    success = @user && @user.save

    if success && @user.errors.empty?
      if !@user.parenttoken.nil?
      	@attr = { :invitetoken => @user.parenttoken }
      	@user.friends.create(@attr)
---
INSERT INTO `users` (`salt`, `fb_img`, `avatar_updated_at`, `updated_at`, `mobilephone`, `avatar_file_name`, `avatar_file_size`, `crypted_password`, `remember_token_expires_at`, `country`, `fb_user_id`, `gender`, `invitetoken`, `email_hash`, `avatar_content_type`, `remember_token`, `birthday`, `first_name`, `parenttoken`, `login`, `last_name`, `email`, `created_at`) VALUES('f2c292d8da45c30e4ee9c01c7376a76df807b85a', 'http://profile.ak.fbcdn.net/v225/1143/114/s754801914_5466.jpg', NULL, '2010-05-23 21:50:52', 2325252352565, NULL, NULL, 'd52d69849c0f53d5960bab18e3be2b9f268e511e', NULL, 'United States', 754801914, 'Female', '82fe8f27a3f37aaa43c25890e2dbe17e', NULL, NULL, NULL, '2010-05-23', 'Yogesh', NULL, 'yvermasixtyforut', 'Verma', 'yogeshkumarverma31789@gmail.com', '2010-05-23 21:50:52')
INSERT INTO `friends` (`updated_at`, `invitetoken`, `user_id`, `created_at`) VALUES('2010-05-23 19:38:11', '4348b35b523bfea707d5a1954da5cbef', 39, '2010-05-23 19:38:11')